 # Pandas

In [1]:
import pandas as pd

# Series

In [3]:
# creating series with index
x=pd.Series([10,20,30],index=['a','b','c'])
print(x)

a    10
b    20
c    30
dtype: int64

In [4]:
# creating series with default index
s1=pd.Series([10,20,30])
s1

0    10
1    20
2    30
dtype: int64

In [6]:
# months in a year
months=['january','february','march','april','may']
# sales data
sales=[1200,10000,2000,1800,800]
# creating pandas series with month as index
sales_series=pd.Series(sales,index=months,name='monthly sales(USD)')
# display the series
print(sales_series)

january      1200
february    10000
march        2000
april        1800
may           800
Name: monthly sales(USD), dtype: int64

# dataframe

In [8]:
data={'name':['alice','bob'],
     'age':[25,30],
     'city':['bangalore','chennai']}
df=pd.DataFrame(data)
print(df)

    name  age       city
0  alice   25  bangalore
1    bob   30    chennai

In [9]:
data={'name':['alice','bob','mani'],
     'age':[25,30,28],
     'city':['bangalore','chennai','london']}
df=pd.DataFrame(data)
print(df)

    name  age       city
0  alice   25  bangalore
1    bob   30    chennai
2   mani   28     london

In [12]:
data={'name':['alice','bob'],
     'age':[25,30],
     'city':['bangalore','chennai']}

#  adding new columns

df['email']=['alice@gmail.com','bob@gmail.com']
df

    name  age       city            email
0  alice   25  bangalore  alice@gmail.com
1    bob   30    chennai    bob@gmail.com

In [13]:
#  adding new rows

df['name']=['nan','pan']
df

  name  age       city            email
0  nan   25  bangalore  alice@gmail.com
1  pan   30    chennai    bob@gmail.com

In [28]:
data={'name':['alice','bob'],
     'age':[25,30],
     'city':['bangalore','chennai']}
df=pd.DataFrame(data)
# adding multiple cols
df[['phone','address']]=pd.DataFrame({'phone':[234657,747798],
                      'address':['jugyfc','hfrsdxf']})
df

    name  age       city   phone  address
0  alice   25  bangalore  234657   jugyfc
1    bob   30    chennai  747798  hfrsdxf

In [24]:

data1={'name':['alice','bob'],
     'age':[25,30],
     'city':['bangalore','chennai']}

df1=pd.DataFrame(data1)

#  adding new columns
new_col='email'
value=['alice@gmail.com','bob@gmail.com']


# add column in specific position

insert_index=2
df1.insert(insert_index,new_col,value)
df1

    name  age            email       city
0  alice   25  alice@gmail.com  bangalore
1    bob   30    bob@gmail.com    chennai

In [53]:

data1 = pd.DataFrame({'math': [75, 87, 54, 43, 76]})

# Insert new column as 3rd column (index 2)
data1.insert(1, 'GK', [55, 76, 43, 87, 89])

print("After inserting new column in 3rd position is:")
print(data1)

After inserting new column in 3rd position is:
   math  GK
0    75  55
1    87  76
2    54  43
3    43  87
4    76  89

In [41]:
#add column in a specific position

data2 = {'Name': ['Alice', 'Bob', 'Sam'],
         'Age':[25, 30,21],
         'city':['Banglore', 'Chennai', 'london']}
df = pd.DataFrame(data2)
print(df)
print("Adding new coloumn")
df['email']=['Alice@gmail.com', 'Bob@gmail.com','Sam@gmail.com']
print(df)

#creating new coloumn 'Gender'

    Name  Age      city
0  Alice   25  Banglore
1    Bob   30   Chennai
2    Sam   21    london
Adding new coloumn
    Name  Age      city            email
0  Alice   25  Banglore  Alice@gmail.com
1    Bob   30   Chennai    Bob@gmail.com
2    Sam   21    london    Sam@gmail.com

In [42]:
new_Column_name='Gender'

new_Column=['Female', 'Male', 'Male']

#define the name and index where
# you want to insert new coloumn
insert_index=2
df.insert(insert_index,new_Column_name,new_Column)
df

    Name  Age  Gender      city            email
0  Alice   25  Female  Banglore  Alice@gmail.com
1    Bob   30    Male   Chennai    Bob@gmail.com
2    Sam   21    Male    london    Sam@gmail.com